Repository: WynnChen/MDN-doc-zh_CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: (If no corresponding current topic exists, use the NeedsUpdate tag, and add an explanation on the Talk page.) Pages with the Archive tag are eventually moved from the main content of MDN to the Archive section.
zh_cn: （如果没有相应的当前主题存在，用上 NeedsUpdate 标签，并且在Talk页面上添加一个说明。）具有 Archive 标签的页面最终将从 MDN 主内容区移动到归档区。

source: ... left column contents ...
zh_cn: ... 左栏内容 ...

source: ... right column contents ...
zh_cn: ... 右栏内容 ...

source: <<<finish this once we finalize the landing page standards>>>
zh_cn: <<<一旦我们完成着陆页标准之后就会来写完这些>>>

source: Commonly-used macros on MDN, with explanations.
zh_cn: MDN 常用宏，带有解说。

source: JavaScript/Guide - Main table-of-contents page
zh_cn: JavaScript/Guide - 主目录页

source: Archive: Use for content that is technically superseded and no longer useful.
zh_cn: Archive（归档）：对技术上已被取代且不再有用的内容使用此标签。

source: Junk: Use for spam, pages created by mistake, or content that is so bad that it should be deleted.
zh_cn: Junk（垃圾）：对垃圾页面使用此标签。页面是错误创建的，或内容实在太差而应当删除。

source: Obsolete: Use for content that is technically superseded, but still valid in context.
zh_cn: Obsolete（过时）：对技术上已被取代、但仍在特定上下文中有用的内容使用此标签。

source: Correct: email, re-elect, co-op
zh_cn: 正确：email, re-elect, co-op

source: Incorrect: e-mail, reelect, coop
zh_cn: 错误：e-mail, reelect, coop

source: Cascading Style Sheets, most of the time abbreviated as CSS, is a stylesheet language used to describe the presentation of a document written in HTML or XML (including various XML languages like SVG or XHTML).
zh_cn: 级联样式表(Cascading Style Sheets),，通常缩写为 CSS，是一种样式表语言，用于描述用HTML、XML（包括诸如 SVG 或 XHTML的各种 XML 语言）所编写文档的呈现。.

source: Correct: "A new method for creating JavaScript rollovers"
zh_cn: 正确："A new method for creating JavaScript rollovers"

source: Correct: "XUL (XML User Interface Language) is Mozilla's XML-based language..."
zh_cn: 正确："XUL (XML User Interface Language) is Mozilla's XML-based language..."

source: Correct: ... web browsers, and so on.
zh_cn: 正确：... web browsers, and so on.

source: Correct: 1990s
zh_cn: 正确：1990s

source: Correct: 2006/02/24
zh_cn: 正确：2006/02/24

source: Correct: 4000; 54,000
zh_cn: 正确：4000; 54,000

source: Correct: 486s
zh_cn: 正确：486s

source: Correct: CD-ROMs
zh_cn: 正确：CD-ROMs

source: Correct: Click the Edit button.
zh_cn: 正确：点击编辑按钮。

source: Correct: February 24, 2006
zh_cn: 正确：February 24, 2006

source: Correct: I will travel on trains, planes, and automobiles.
zh_cn: 正确：I will travel on trains, planes, and automobiles.

source: Correct: Web browsers (e.g. Firefox) can be used ...
zh_cn: 正确：Web browsers (e.g. Firefox) can be used ...

source: Correct: Web browsers such as Firefox can be used ...
zh_cn: 正确： Web browsers such as Firefox can be used ...

source: Correct: XUL
zh_cn: 正确：XUL

source: Correct: localize, honor
zh_cn: 正确：localize, honor

source: Correct: syllabuses, octopuses
zh_cn: 正确：syllabuses, octopuses

source: Correct: the {{HTMLElement("span")}} element
zh_cn: 正确：{{HTMLElement("span")}} 元素

source: Incorrect: "A New Method for Creating JavaScript Rollovers"
zh_cn: 错误："A New Method for Creating JavaScript Rollovers"

source: Incorrect: "XUL is Mozilla's XML-based language..."
zh_cn: 错误："XUL is Mozilla's XML-based language..."

source: Incorrect: ... web browsers, etc.
zh_cn: 错误：... web browsers, etc.

source: Incorrect: 02/24/2006; 24/02/2006; 02/24/06
zh_cn: 错误：02/24/2006; 24/02/2006; 02/24/06

source: Incorrect: 1990's
zh_cn: 错误：1990's

source: Incorrect: 4,000; 54000
zh_cn: 错误：4,000; 54000

source: Incorrect: 486's
zh_cn: 错误：486's

source: Incorrect: CD-ROM's
zh_cn: 错误：CD-ROM's

source: Incorrect: Click Edit.
zh_cn: 错误：点击编辑。

source: Incorrect: February 24th, 2006; 24 February, 2006; 24/02/2006
zh_cn: 错误：February 24th, 2006; 24 February, 2006; 24/02/2006

source: Incorrect: I will travel on trains, planes and automobiles.
zh_cn: 错误：I will travel on trains, planes and automobiles.

source: Incorrect: Web browsers e.g. Firefox can be used ...
zh_cn: 错误：Web browsers e.g. Firefox can be used ...

source: Incorrect: Web browsers, (eg: Firefox) can be used ...
zh_cn: 错误：Web browsers, (eg: Firefox) can be used ...

source: Incorrect: Web browsers, e.g. Firefox, can be used ...
zh_cn: 错误：Web browsers, e.g. Firefox, can be used ...

source: Incorrect: X.U.L.; Xul
zh_cn: 错误：X.U.L.; Xul

source: Incorrect: localise, honour
zh_cn: 错误：localise, honour

source: Incorrect: syllabi, octopi
zh_cn: 错误：syllabi, octopi

source: Incorrect: the span tag
zh_cn: 错误：span 标签

source: CSS Flexible Box Layout is a module of CSS that defines a multi-column layout, allowing to express how content should flow between columns, and how gaps and rules are handled.
zh_cn: CSS 弹性框布局 是定义多栏布局的 CSS 模块，可以表述内容应当如何在各栏之间流动，以及栏间距与规则应当如何处理。

source: CSS is one of the core languages of the open web and has a standardized W3C specification.
zh_cn: CSS 是开放网络(open web)的核心语言之一，拥有标准化的 W3C 规范。

source: Landing pages are pages at the root of a topic area of the site, such as the main CSS or HTML pages.
zh_cn: 着陆页是指站点中位于主题区域根源位置的页面，诸如 CSS 或 HTML 的主页面。

source: Note: Though CSS Flexible Boxes Layout specification is at the Last Call Working Draft stage (see also the Latest Editor draft), not all browsers have implemented all features of Flexbox.
zh_cn: 注意： 虽然 CSS 弹性框布局规范 还处于最终征求意见稿 (Last Call Working Draft)阶段（参见最新编辑草案），并非所有浏览器都实现了弹性框的所有功能。

source: The CSS3 Flexible Box, or flexbox, is a layout mode providing for the arrangement of elements on a page such that the elements behave predictably when the page layout must accommodate different screen sizes and different display devices. For many applications, the flexible box model provides an improvement over the block model in that it does not use floats, nor do the flex container's margins collapse with the margins of its contents.
zh_cn: CSS3 弹性框(Flexible Box 或 flexbox)，是一种当页面需要适应不同的屏幕大小以及设备类型时确保元素拥有恰当排布行为的布局方式。对很多应用而言，由于不使用浮动，且弹性容器的外边距也不会与其内容的外边距合并，弹性框模型比起方框模型要好一些。

source: To present documentation in an organized, standardized and easy-to-read manner, the Mozilla Developer Network style guide describes how a text should be organized, spelled, formatted, and so on.
zh_cn: MDN 样式指南描述了文本的组织方式、拼写和格式等问题，以求能以一种有组织、标准化且易于阅读的方式呈现文档。

source: Use the serial comma.
zh_cn: 使用系列逗号。

source: A collection of demos showing the latest CSS technologies in action: a boost for the creativity.
zh_cn: 此演示汇集以实际行动展示最新的 CSS 技术：为创新加油！

source: A step-by-step introduction to help complete beginners get started.
zh_cn: 面向完全新手的入门教程，助其上手。

source: A brief (typically one paragraph) overview of what the technology is and how it's used.
zh_cn: 简短（通常是一个段落）的概述，说明技术是什么以及如何使用它。

source: A confirmation dialog appears, asking the user if he allows the Web page to make use of his Web cam.
zh_cn: 弹出对话框来询问用户是否允许网页使用他的(his)摄像头。

source: A confirmation dialog appears, asking the user if he or she allows the web page to make use of his/her Web cam.
zh_cn: 弹出对话框来询问用户是否允许网页使用他的/她的(his/her)摄像头。

source: A confirmation dialog appears, asking the user if she allows the Web page to make use of her Web cam.
zh_cn: 弹出对话框来询问用户是否允许网页使用她的(her)摄像头。

source: A confirmation dialog appears, asking the user if they allow the Web page to make use of their Web cam.
zh_cn: 弹出对话框来询问用户是否允许网页使用其(their)摄像头。

source: A confirmation dialog appears, asking the users if they allow the Web page to make use of their Web cams.
zh_cn: 弹出对话框来询问用户们(users)是否允许网页使用他们的(their)摄像头。

source: A confirmation dialog appears, requesting the user's permission for Web cam access.
zh_cn: 弹出对话框来请求用户给予使用摄像头的权限。

source: A confirmation dialog box appears, which asks the user for permission to use the Web cam.
zh_cn: 弹出请求用户给予使用摄像头的权限的对话框。

source: A list of links to landing pages for other, related, technologies of relevance.
zh_cn: 通往其他相关技术的着陆页的链接列表。

source: A list of tools the user can look at to help with the use of the technology described in this section of MDN.
zh_cn: 能够帮助用户使用在 MDN 此区域中所描述技术的工具列表。

source: A two-column list of links with appropriate headings.
zh_cn: 带有恰当标题的两栏链接列表。

source: Abbrev
zh_cn: 缩写

source: Acronyms and abbreviations
zh_cn: 首字母缩略词与缩写

source: Also, at least the first time you reference a given element in a section should use the {{TemplateLink("HTMLElement")}} macro, to create a link to the documentation for the element (unless you're writing within that element's reference document page).
zh_cn: 同样，至少每个章节中对特定元素的第一次引用应当使用 {{TemplateLink("HTMLElement")}} 宏，来建立通向此元素文档的链接（除非刚好是在编写此元素的参考文档页）。

source: Alternately, you can use the YYYY/MM/DD format.
zh_cn: 也可以用 YYYY/MM/DD 的格式。

source: Always consider whether it's truly beneficial to use a Latin abbreviation.
zh_cn: 任何时候都要考虑一下用拉丁缩写是不是真的有收益。

source: An exhaustive reference for seasoned Web developers describing every property and concept of CSS.
zh_cn: 面向资深 Web 开发者的全面参考，描述了 CSS 的各个属性与该念。

source: An optional "Browser compatibility" section at the bottom of the page.
zh_cn: 可选的“浏览器兼容性”区段，出现在页面底部。

source: And be sure that you use them correctly, if you choose to do so.
zh_cn: 假如选择使用拉丁缩写，请确保你自己没有用错。

source: Aside from looking horrible, it's helpful to readers if every heading has at least a brief intro after it to introduce the subsections beneath.
zh_cn: 这样看起来很糟糕，并且对于读者来说，在每个标题后都至少有段介绍子章节的简介会很有帮助。

source: Attach the desired image file to the article (at the bottom of every article in edit mode)
zh_cn: 将想要的图像文件附加到文章（编辑模式下在文章底部）

source: Attribute definitions
zh_cn: 属性定义

source: Attribute names
zh_cn: 属性名

source: Attribute values
zh_cn: 属性值

source: Basic support
zh_cn: 基础支持

source: Basics
zh_cn: 基本原则

source: Below that is a
zh_cn: 在它之下是文章的

source: Below that is a <dl> list of articles with each article's link in a <dt> block and a brief one-or-two sentence summary of the article in the corresponding <dd> block.
zh_cn: 接下来是一个文章的 <dl> 列表，每篇文章的链接在 <dt> 块中，文章的一两句简短摘要则出现在相应的 <dd> 块。

source: Below you'll find some basic information, but you can find a complete guide to creating and editing links on MDN in our editor guide.
zh_cn: 下面是一些基本信息，在我们的编辑指南中的在 MDN 创建与编辑链接处有完整的指南。

source: Both versions are gender-specific.
zh_cn: 这两个版本都是限定性别的。

source: Box model
zh_cn: 方框模型(box model)

source: Browser compatibility
zh_cn: 浏览器兼容性

source: By default, the first paragraph of the page is used as the SEO summary.
zh_cn: 默认情况下，页面的第一个段落将作为 SEO 摘要。

source: CSS Properties
zh_cn: CSS 属性

source: CSS Reference
zh_cn: CSS 参考

source: CSS Tutorial
zh_cn: CSS 教程

source: CSS describes how the structured element must be rendered on screen, on paper, in speech, or on other media.
zh_cn: CSS 描述了在屏幕、纸面、语音或其它媒体上，结构化元素要如何渲染。

source: CSS key concepts
zh_cn: CSS 关键概念

source: CSS3 Demos
zh_cn: CSS3 演示

source: Capitalization
zh_cn: 大小写

source: Capitalization and periods
zh_cn: 大写与句点

source: Child elements in a flexbox can be laid out in any direction and can have flexible dimensions to adapt to the display space.
zh_cn: 弹性框中的子元素可以在各个方向上进行布局，并且能以弹性尺寸来适应显示空间。

source: Choosing titles and slugs
zh_cn: 选择标题与缩略名(slug)

source: Click the "pre" button in the toolbar to create the preformatted content box in which you'll then write your code.
zh_cn: 点击工具栏上的 "pre" 按钮来创建预格式化的内容框，随后在其中写下代码。

source: Code sample style and formatting
zh_cn: 示例代码的样式与格式

source: Commas
zh_cn: 逗号

source: Comment
zh_cn: 注解

source: Common Latin abbreviations (etc., i.e., e.g.) may be used in parenthetical expressions and notes.
zh_cn: 常见的拉丁缩写(etc., i.e., e.g.)可用于括号表达或注解中。

source: Contractions
zh_cn: 缩略

source: Create an image in the WYSIWYG editor
zh_cn: 在所见即所得编辑器中建立图像

source: Creating a page link list
zh_cn: 建立页面链接列表

source: Creating new subtrees
zh_cn: 创建新子树

source: Dates
zh_cn: 日期

source: Decades
zh_cn: 年代

source: Deprecated:
zh_cn: 废弃(deprecated)：

source: Developed in levels, CSS1 is now obsolete, CSS2.1 is a recommendation, and CSS3, now split into smaller modules, is progressing on the standardization track.
zh_cn: CSS的发展分为多个级别，CSS1 现已过时，CSS2.1 是推荐标准，CSS3现在划分为多个小模块，正在标准化的进程中。

source: Do not be upset or surprised, however, if an industrious volunteer later edits your work to conform to this guide.
zh_cn: 不过，稍后可能会有勤劳的志愿者修改你的作品，以求符合本指南，碰到这种情况时无需惊讶，也别沮丧。

source: Do not use variant spellings.
zh_cn: 不要使用变体拼写。

source: Documentation and tutorials
zh_cn: 文档与教程

source: Don't create single subsections -- you don't subdivide a topic into one.
zh_cn: 不要建立单一的子章节——你并不会把一个主题细分为一部分。

source: Don't have bumping heads, which are headings followed immediately by headings.
zh_cn: 避免在标题后面紧跟另一个标题。

source: Don't use an apostrophe.
zh_cn: 不要用撇号(')。

source: E.g.: When the type attribute of an element is set to email or tel ...
zh_cn: 例如：当 元素的 type 属性设为 email 或 tel 时……

source: Each article may have as many tags as needed.
zh_cn: 如有需要，每篇文章可以拥有任意数量标签。

source: Element names
zh_cn: 元素名

source: English
zh_cn: 英语

source: Entire lines (or multiple lines) of code should be formatted using syntax highlighting rather than the {{HTMLElement("code")}} element.
zh_cn: 整行（或多行）代码应当用语法高亮来格式化，而非 {{HTMLElement("code")}} 元素。

source: Ever.
zh_cn: 绝对不要。

source: Every page in the wiki should have tags.
zh_cn: 在 wiki 上的每个页面都应当有标签。

source: Expansion
zh_cn: 展开形式

source: External links
zh_cn: 外部链接

source: Feature
zh_cn: 特性

source: Feel free to update them as needed if you like.
zh_cn: 只要你愿意，随时可以对它们进行必要的更新。

source: Flexible boxes concept
zh_cn: 弹性框概念

source: For Mozilla-specific technologies, the API is no longer implemented in Mozilla code; for Web standard technology, the API or feature is no longer supported by current, commonly-used browsers.
zh_cn: 对于 Mozilla 专有技术，API 在 Mozilla 代码中不再有所实现；对于 Web 标准技术，API 或特性在当前常见通用浏览器中不再受支持。

source: For Mozilla-specific technologies, the API is still supported in Mozilla code; for Web standard technology, the API or feature has been removed or replaced in a recent version of the defining standard.
zh_cn: 对于 Mozilla 专有技术，API 在 Mozilla 代码中仍然有所支持；对于 Web 标准技术，API 或特性在最近一个版本的标准定义中有所删改。

source: For WebKit bugs, you can use this macro:
zh_cn: 对于 WebKit bug，用这个宏：

source: For dates (not including dates in code samples) use the format "January 1, 1990".
zh_cn: 对于日期（不包括示例代码中的日期）使用"January 1, 1990"的格式。

source: For decades, use the format "1990s".
zh_cn: 对于年代，用"1990s"的格式。

source: For example an HTML element that is obsolete in HTML5 is still valid in HTML 4.01.
zh_cn: 例如，在 HTML5 中已过时但在 HTML4.01 中仍有效的 HTML 元素。

source: For example, "Enter" not "ENTER."
zh_cn: 例如，"Enter"而非"ENTER"。

source: For example, "the frenchText() function".
zh_cn: 例如，“frenchText() 函数”

source: For example, a page that describes how to use the Mozilla CVS repository should refer readers to a current topic on using Mercurial repos.
zh_cn: 例如，描述如何使用 Mozilla CVS 仓库的页面应当将读者导向当前关于使用 Mercurial repos 的主题。

source: For example, an article about using JavaScript in AJAX programming might have both "JavaScript" and "AJAX" as tags.
zh_cn: 例如，一篇关于在 AJAX 编程中JavaScript 的使用的文章可以同时用"JavaScript"和"AJAX"作为标签。

source: For example, be careful not to confuse "e.g." with "i.e.", which is a common error.
zh_cn: 例如，一个常见的错误是把"e.g."与"i.e."混淆。

source: For example, consider the JavaScript guide, which is structured as follows:
zh_cn: 以 JavaScript 指南为例，它的结构如下：

source: For example, use them next to the bold attribute name but not for every occurrence in your body text.
zh_cn: 例如，将其用在加粗的属性名旁边，但并不是在正文中每次出现加粗的属性名时都用。

source: For example, writing \{{HTMLElement("title")}} produces "{{HTMLElement("title")}}".
zh_cn: 例如，写下 \{{HTMLElement("title")}} 将生成 "{{HTMLElement("title")}}"。

source: For example:
zh_cn: 例如：

source: For plurals of acronyms or abbreviations, add s.
zh_cn: 对于首字母缩略词与缩写的复数情况，在后面加s。

source: For plurals of numerals add "s".
zh_cn: 对于数词的复数情况，在后面加"s"。

source: For questions of spelling, please refer to Dictionary.com.
zh_cn: 拼写问题请参考Dictionary.com。

source: For security reasons, you should only create links that use the following schemes:
zh_cn: 由于安全方面的原因，应当只创建使用以下 scheme 的链接：

source: For style standards that apply to content written for sites other than MDN, refer to the One Mozilla style guide.
zh_cn: 为 MDN 以外的站点所写的内容，其应用的样式标准可参考 一体化 Mozilla 样式指南.

source: For words with variant spellings, always use the first entry at Dictionary.com.
zh_cn: 存在多种拼写法的单词，以Dictionary.com上第一个条目的写法为准。

source: Gender-neutral language
zh_cn: 中性语言

source: Getting help from the community
zh_cn: 从社区获得帮助

source: Guides
zh_cn: 指南

source: H2 is the highest level allowed because H1 is reserved for the page title.
zh_cn: 允许使用的最高级别是 H2，因为 H1 要留给页面标题。

source: HTML elements
zh_cn: HTML 元素

source: However, you can override this behavior by marking a section with the "SEO summary" style in the WYSIWYG editor.
zh_cn: 然而，可以通过对段落应用所见即所得编辑器中的“SEO 摘要”样式来覆盖此行为。

source: Hyphenate compounds when the last letter of the prefix is a vowel and is the same as the first letter of the root.
zh_cn: 如果复合词的前缀部分最后一个字母是一个元音，且与字根的第一个字母一样，则需要断字。

source: Hyphenation
zh_cn: 断字

source: Identify the user interface element by its label and type.
zh_cn: 用户界面元素通过其标签(label)与类型来识别。

source: If no appropriate transformation is available, use the pre tag without specifying a language ("No Highlight" in the language menu).
zh_cn: 如果没有合适的转化可用，那么用 pre 标记同时不指定任何语言（语言列表中的“不高亮”）。

source: If possible, add a note to the topic referring readers to a more current topic.
zh_cn: 如果有可能，为此主题添加一个注解，将读者导向更新的主题。

source: If you can't do it using a predefined class, drop into {{IRCLink("mdn")}} and ask for help.
zh_cn: 如果无法靠预定义类型搞定，请到 {{IRCLink("mdn")}} 寻求帮助。

source: If you don't want to create a link, enclose the name in angle brackets and use "Code (inline)" style (e.g.,
zh_cn: 如果不想建立链接，用尖括号括住名称并使用“代码（内联）”样式（例如，

source: If you have questions about usage and style not covered here, we recommend referring to the Economist style guide or, failing that, the Chicago Manual of Style.
zh_cn: 如果对这里未包含的用法与样式有疑问，推荐参考Economist style guide，或者，如果还是没找到，Chicago Manual of Style。

source: If you need more than three or four levels of headers you should consider breaking up the article into several smaller articles with a landing page, linking them together using the {{TemplateLink("Next")}}, {{TemplateLink("Previous")}}, and {{TemplateLink("PreviousNext")}} macros.
zh_cn: 如果标题要超过三或四个级别，应当考虑将文章拆分成一系列更小的文章和相应的着陆页，通过 {{TemplateLink("Next")}}、{{TemplateLink("Previous")}} 和 {{TemplateLink("PreviousNext")}} 这几个宏将它们链接在一起。

source: If you're interested in improving your writing and editing skills, you may find the following resources to be helpful.
zh_cn: 如果对改进写作与编辑能力有兴趣，以下资源对你可能有用。

source: If you're looking for specifics of how a given type of page should be structured, see the MDN page layout guide.
zh_cn: 如果你正在寻找某种特定类型页面具体应当如何结构化，参见 页面布局指南。

source: In addition to using tags to track information about the documentation's quality and content, we also use them to mark articles as needing specific types of work.
zh_cn: 除了用标签来跟踪有关文档质量和内容的信息，我们也用标签来将文章标记为需要特定类型的工作。

source: In addition, they should almost always be wrapped in "<>", and should be in the {{HTMLElement("code")}} style.
zh_cn: 另外，基本上在所有情况下都应当在元素名外面加上"<>"，并且应当应用 {{HTMLElement("code")}} 样式。

source: In notes and parentheses
zh_cn: 在注解和括号中

source: In particular, be sure not to use the about: or chrome:// schemes, as they will not work.
zh_cn: 尤其是，绝对不要用 about: 或 chrome:// scheme，它们无法正常工作。

source: In regular text (i.e. text outside of notes or parentheses), use the English equivalent of the abbreviation.
zh_cn: 在常规文本中 （即，注解与括号之外的文本），使用与这些缩写等价的英语表达。

source: In running text
zh_cn: 在连续文本中

source: In running text, use commas only in five-digit and larger numbers.
zh_cn: 在连续文本中，只有5位或者或者更多位的数字才加逗号分段。

source: In task sequences, describe user interface actions using the imperative mood.
zh_cn: 在任务序列中，用祈使语气描述用户界面操作。.

source: In the WYSIWYG editor, in the drop-down list of attachments, select the newly created attachment that is your image
zh_cn: 所见即所得编辑器中，在附件下拉列表中选择最近创建的附件，即是需要的图像

source: Indent the code cleanly, with open-brace ("{") characters on the same line as the statement that opens the block.
zh_cn: 代码缩进要清晰，左花括号("{")应当与开启这个块的语句在同一行。

source: Initial definition.
zh_cn: 初始定义。

source: Inline code formatting
zh_cn: 内联代码格式

source: Instead, break at natural breaking points.
zh_cn: 取而代之的是，在自然中断点处断行。

source: It is a good idea to use gender-neutral language in any writing where gender is irrelevant to the subject matter, to make the text as inclusive as possible.
zh_cn: 在写任何与性别无关的主题时，使用中性语言都是个好主意，能使文字尽可能具有包容性。

source: It is also used by macros that automate the construction of landing pages inside MDN itself.
zh_cn: 同时，在 MDN 内部自动建立着陆页的宏也会用到它。

source: It presents all the needed fundamentals.
zh_cn: 提供了所有必要的基础。

source: It will be reported as a summary of the article to robots crawling the site, and will then appear in search results for the page.
zh_cn: 对于抓取网站的机器人来说，这将做为文章的摘要，随后显示在这个页面相应的搜索结果中。

source: It's either two subheadings or more or none at all.
zh_cn: 要么有两个或更多子标题，要么就根本一个都没。

source: It's important to be clear about the difference between the terms obsolete and deprecated.
zh_cn: 弄清术语 过时(obsolete) 与 废弃(deprecated) 之间的区别是非常重要的。

source: It's sometimes helpful to provide an image in an article you create or modify, especially if the article is very technical.
zh_cn: 在一些时候，在文章中提供图像会很有帮助，尤其当文章非常技术性时。

source: Keyboard keys should use sentence-style capitalization, not all-caps capitalization.
zh_cn: 键盘键位应当用句子形式的大小写规则，而非全大写。

source: Labeling attributes
zh_cn: 为属性打上标签

source: Landing pages
zh_cn: 着陆页

source: Language, grammar, spelling
zh_cn: 语言、语法、拼写

source: Latin
zh_cn: 拉丁文

source: Latin abbreviations
zh_cn: 拉丁缩写

source: Let's take the following example:
zh_cn: 看下面这个例子：

source: Links
zh_cn: 链接

source: Links are a large part of what makes a wiki a powerful learning and teaching tool.
zh_cn: wiki 能成为强大的学习与教学工具，链接是很大一部分原因。

source: Long lines shouldn't be allowed to stretch off horizontally to the extent that they require horizontal scrolling to read.
zh_cn: 不允许长代码行水平延伸到需要水平滚动才能阅读的地步。

source: MDN allows the use of this very common syntax (which is controversial among usage authorities), to make up for the lack of a neutral gender in English.
zh_cn: MDN 允许使用这种常见语法（使用上是有争议的）来解决英语缺乏中性用法的问题。

source: MDN is an exception to this rule.
zh_cn: MDN 是此规则的一个例外。

source: MDN-specific
zh_cn: MDN 专用

source: Many designers will find the flexbox model easier to use.
zh_cn: 许多设计师会发现弹性框模型易于使用。

source: Margin collapsing
zh_cn: 外边距合并(margin collapsing)

source: Meanings and English equivalents of Latin abbreviations
zh_cn: 拉丁文本的含义与等价的英语表达

source: Method names should be followed by a pair of parentheses: doSomethingUseful().
zh_cn: 方法名后面应当跟有一对括号：doSomethingUseful()。

source: Numbers and numerals
zh_cn: 数与数词

source: Obsolete vs. deprecated
zh_cn: 过时(obsolete) vs. 废弃(deprecated)

source: Obsolete:
zh_cn: 过时(obsolete)：

source: On MDN, the term deprecated marks an API or technology that is no longer recommended, but is still implemented and may still work.
zh_cn: 在 MDN，术语废弃表示某 API 或技术不再推荐，但仍然有所实现并可能仍可运作。

source: On MDN, the term obsolete marks an API or technology that is not only no longer recommended, but also no longer implemented in the browser.
zh_cn: 在 MDN，术语过时表示某 API 或技术不仅不再推荐，同时浏览器中也不再对其进行实现。

source: On the first mention of a term on a page, expand acronyms likely to be unfamiliar to users.
zh_cn: 页面上第一次提到某个术语时，用户可能并不熟悉首字母缩略词的展开形式。

source: Other languages may have (and are welcome to create) style guides.
zh_cn: 其它语言可以拥有（且欢迎创建）自己的样式指南。

source: Other references
zh_cn: 其他参考

source: Others may or may not work, but are not supported and will probably be removed by editorial staff.
zh_cn: 其他 scheme 可能运作也可能不运作，但全都不受支持且有可能被编辑人员移除。

source: Our writing style tends to be casual, so you should feel free to use contractions (e.g. "don't", "can't", "shouldn't") if you prefer.
zh_cn: 我们的写作风格趋于休闲，因此只要你想，可以随意使用缩略（例如"don't", "can't", "shouldn't"）。

source: Page slugs should be kept short; when creating a new level of hierarchy, the new level's component in the slug should just be a word or two.
zh_cn: 页面的缩略名应保持简短；创建新的层级时，该层级在缩略名中应当只有一两个单词。
